//*************************************************************************************************************
//
// ゲーム処理 [game.h]
// Author:IKUTO SEKINE
//
//*************************************************************************************************************
#ifndef _GAME_H_
#define _GAME_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "mode.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class C2DUi;
class CPlayer;
class CGame : public CMode
{
public:
	enum
	{
		UI_BG = 0,
		UI_TIMER,
		UI_MAX,
	};

	CGame() {};					// コンストラクタ
	~CGame() {};					// デストラクタ

	static CGame *Create(void);	// 生成
	void Init(void);				// 初期化
	void Uninit(void);				// 終了
	void Update(void);				// 更新
	void Draw(void);				// 描画

private:
	void UpdateNormal(void);		// 通常更新
	void UpdateOut(void);			// アウト更新
	C2DUi *pC2dui[UI_MAX];					// ２DUIポインタ
	CPlayer *m_pPlayer;				// プレイヤポインタ
};

#endif