//*************************************************************************************************************
//
// プレイヤー処理 [player.h]
// Author:IKUTO SEKINE
//
//*************************************************************************************************************
#ifndef _PLAYER_H_
#define _PLAYER_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "Scene.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class C2DUi;
class CScene2D;
class CPlayer : public CScene
{
public:
	CPlayer():CScene(PRIORITY_PLAYER){};		// コンストラクタ
	~CPlayer() {};								// デストラクタ

	static CPlayer *Create(D3DXVECTOR3 &pos, D3DXVECTOR2 &size);				// 生成
	void Init(D3DXVECTOR3 &pos, D3DXVECTOR2 &size);							// 初期化
	void Init(void) {};							// 初期化
	void Uninit(void);							// 終了
	void Update(void);							// 更新
	void Draw(void);							// 描画

private:
	CScene2D *m_pScene2D;					// シーン２Dポインタ
};

#endif