//*************************************************************************************************************
//
// ランキング処理 [ranking.h]
// Author:IKUTO SEKINE
//
//*************************************************************************************************************
#ifndef _RANKING_H_
#define _RANKING_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "mode.h"

//-------------------------------------------------------------------------------------------------------------
// マクロ定義
//-------------------------------------------------------------------------------------------------------------
#define MAX_NUMSCORE	(5)		// 最大スコアの数

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class C2DUi;
class CRanking : public CMode
{
public:
	CRanking() {};					// コンストラクタ
	~CRanking() {};					// デストラクタ

	static CRanking *Create(void);	// 生成
	void Init(void);				// 初期化
	void Uninit(void);				// 終了
	void Update(void);				// 更新
	void Draw(void);				// 描画

	static void SetPlayerScore(const float fScore) { m_fPlayerScore = fScore; }	// プレイヤーのスコア設定

private:
	C2DUi *pC2dui;					// ２DUIポインタ

	static float m_fPlayerScore;	// プレイヤーのスコア
	static float m_fDefaultScore[MAX_NUMSCORE];	// デフォルトのスコア
};

#endif